Revit 2023 API
LabelUtils.GetLabelFor Method (BuiltInParameterGroup)
 Gets the user-visible name for a BuiltInParameterGroup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static string GetLabelFor(
	BuiltInParameterGroup builtInParamGroup
)
Visual Basic
Public Shared Function GetLabelFor ( _
	builtInParamGroup As BuiltInParameterGroup _
) As String
Visual C++
public:
static String^ GetLabelFor(
	BuiltInParameterGroup builtInParamGroup
)
Parameters
builtInParamGroup
Type: Autodesk.Revit.DB.BuiltInParameterGroup
 The BuiltInParameterGroup to get the user-visible name.
Remarks
 The name is obtained in the current Revit language.
See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace